---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SelectionFilterElement
source: html/e4fc753d-21fc-6208-f9f8-567f15d5ae88.htm
---
# SelectionFilterElement Members

Adds a set of ElementIds to the filter's set.